src_ext/Catalogs/УЗ_ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ДисконтныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКартыШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_ДвижениеДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_ДвижениеДисконтныхКарт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_ДисконтныеКарты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//В24 (решение владельца 28.09.2026): единые проверки дисконтной карты для всех документов с бонусами — урок
//(начисление), «Начисление бонусов», ПКО и списание остатков (списание). Правила:
//  * «Не действует» — карта не принимается;
//  * срок действия — с ДатаНачалаДействия по ДатаОкончанияДействия включительно (пустая дата — без ограничения);
//  * Владелец — карта ученика строки (чужой картой бонусы не начисляются и не тратятся);
//  * сумма бонусов не отрицательная (отрицательное «начисление» было скрытым списанием без проверок);
//  * при списании — не больше остатка карты (по всем организациям, как в ПКО).
//Параметры:
//  ДисконтнаяКарта - СправочникСсылка.УЗ_ДисконтныеКарты
//  Дата - Дата - дата документа
//  СуммаБонусов - Число - начисляемые или списываемые бонусы
//  Списание - Булево - Истина: бонусы тратятся (проверяется остаток)
//  Владелец - СправочникСсылка.УЗ_ФизЛица, Неопределено - ученик документа (не задан — владелец не проверяется)
//Возвращаемое значение:
//  Строка - "" — карта годна, иначе текст отказа.
Функция ПроверитьКарту(ДисконтнаяКарта, Дата, СуммаБонусов = 0, Списание = Ложь, Владелец = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ДисконтнаяКарта) Тогда
		Возврат "";
	КонецЕсли;

	Если ДисконтнаяКарта.НеДействует Тогда
		Возврат СтрШаблон(НСтр("ru = 'Дисконтная карта «%1» не действует (отмечено «Не действует»)'"), ДисконтнаяКарта);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДисконтнаяКарта.ДатаНачалаДействия) И Дата < НачалоДня(ДисконтнаяКарта.ДатаНачалаДействия) Тогда
		Возврат СтрШаблон(НСтр("ru = 'У дисконтной карты «%1» срок действия начинается %2'"),
			ДисконтнаяКарта, Формат(ДисконтнаяКарта.ДатаНачалаДействия, "ДЛФ=D"));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДисконтнаяКарта.ДатаОкончанияДействия) И Дата > КонецДня(ДисконтнаяКарта.ДатаОкончанияДействия) Тогда
		Возврат СтрШаблон(НСтр("ru = 'У дисконтной карты «%1» истек срок действия: действительна по %2'"),
			ДисконтнаяКарта, Формат(ДисконтнаяКарта.ДатаОкончанияДействия, "ДЛФ=D"));
	КонецЕсли;
	Если ЗначениеЗаполнено(Владелец) И ДисконтнаяКарта.Владелец <> Владелец Тогда
		Возврат СтрШаблон(НСтр("ru = 'Дисконтная карта «%1» — карта %2, а не %3'"), ДисконтнаяКарта,
			ДисконтнаяКарта.Владелец, Владелец);
	КонецЕсли;
	Если СуммаБонусов < 0 Тогда
		Возврат СтрШаблон(НСтр("ru = 'Сумма бонусов по карте «%1» отрицательная (%2) — бонусы списывают оплатой бонусами в приходном ордере'"),
			ДисконтнаяКарта, Формат(СуммаБонусов, "ЧДЦ=2"));
	КонецЕсли;
	Если Списание И СуммаБонусов > 0 Тогда
		Остаток = ОстатокБонусов(ДисконтнаяКарта);
		Если СуммаБонусов > Остаток Тогда
			Возврат СтрШаблон(НСтр("ru = 'Недостаточно бонусов на карте «%1»: остаток %2, списывается %3'"),
				ДисконтнаяКарта, Формат(Остаток, "ЧДЦ=2; ЧН=0"), Формат(СуммаБонусов, "ЧДЦ=2"));
		КонецЕсли;
	КонецЕсли;
	Возврат "";

КонецФункции

//Остаток бонусов карты на текущий момент — по всем клиентам и организациям.
Функция ОстатокБонусов(ДисконтнаяКарта) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Остатки.СуммаБонусовОстаток), 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.УЗ_ДвижениеДисконтныхКарт.Остатки(, ДисконтнаяКарта = &ДисконтнаяКарта) КАК Остатки";
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Остаток, 0);

КонецФункции

#КонецЕсли
